In [22]:
import numpy as np 
import pandas as pd
from sklearn.cluster import (
    SpectralBiclustering,
    SpectralClustering,
    SpectralCoclustering,
    HDBSCAN,
)

import sys
sys.path.insert(0, "..")   
from src.data_utils import mav, add_mav_column, normalize_data, mav_by_cluster, median_mean_transform
from src.cluster_util import compute_biclustering_scores, cluster_data, compute_biclustering_scores

In [23]:
%reload_ext autoreload
%autoreload 2

In [24]:
%pwd

'/Users/yvesgreatti/github/kaggle_favorita_grocery_sales_forecasting/notebook'

In [25]:
df = pd.read_parquet("../output/data/train_2014_January_12_store_20_item_cluster.parquet")
cols = [
        "date",
        "store_item",
        "store",
        "item",
        "store_cluster",
        "item_cluster",
        "weight",
        "onpromotion",
        "unit_sales"
    ]
df = df[cols]
df['store_item'] = df['store_item'].astype(str)
df.sort_values(["date", "store_item"], inplace=True)
df.reset_index(drop=True, inplace=True)
df.head()

,date,store_item,store,item,store_cluster,item_cluster,weight,onpromotion,unit_sales
0,2014-01-01,1_1047679,1,1047679,8,1,1,False,0.0
1,2014-01-01,1_1168718,1,1168718,8,0,1,False,0.0
2,2014-01-01,1_1463591,1,1463591,8,0,1,False,0.0
3,2014-01-01,1_1463992,1,1463992,8,4,1,False,0.0
4,2014-01-01,1_1464092,1,1464092,8,5,1,False,0.0

In [37]:
df2 = cluster_data(
    df,
    freq = "W",
    model_class=SpectralCoclustering,
    row_range = range(2, 5),
    col_range = range(2, 5),
    mav_df_fn = "../output/data",
    only_best_model = True,
    only_top_n_clusters = 2,
)

2025-08-20 13:01:38,119 - INFO - Number of items: 20
2025-08-20 13:01:38,120 - INFO - Number of stores: 12
2025-08-20 13:01:38,121 - INFO - Evaluating n_row=2, n_col=2
2025-08-20 13:01:38,235 - INFO - Evaluating n_row=2, n_col=3
2025-08-20 13:01:38,246 - WARNING - [skip] n_row=2, n_col=3: rows<2=[] cols<2=[2]
2025-08-20 13:01:38,247 - INFO - Evaluating n_row=2, n_col=4
2025-08-20 13:01:38,295 - WARNING - [skip] n_row=2, n_col=4: rows<2=[] cols<2=[2, 3]
2025-08-20 13:01:38,295 - INFO - Evaluating n_row=3, n_col=2
2025-08-20 13:01:38,395 - INFO - Evaluating n_row=3, n_col=3
2025-08-20 13:01:38,497 - INFO - Evaluating n_row=3, n_col=4
2025-08-20 13:01:38,509 - WARNING - [skip] n_row=3, n_col=4: rows<2=[] cols<2=[3]
2025-08-20 13:01:38,510 - INFO - Evaluating n_row=4, n_col=2
2025-08-20 13:01:38,527 - WARNING - [skip] n_row=4, n_col=2: rows<2=[3] cols<2=[]
2025-08-20 13:01:38,528 - INFO - Evaluating n_row=4, n_col=3
2025-08-20 13:01:38,545 - WARNING - [skip] n_row=4, n_col=3: rows<2=[3] cols<2=[]
2025-08-20 13:01:38,546 - INFO - Evaluating n_row=4, n_col=4
2025-08-20 13:01:38,563 - WARNING - [skip] n_row=4, n_col=4: rows<2=[3] cols<2=[3]
2025-08-20 13:01:38,575 - INFO - Saving only best model's MAV scores
2025-08-20 13:01:38,577 - INFO - Saving best model mav_df to ../output/data/best_model_mav_df.csv
2025-08-20 13:01:38,637 - INFO - Saving top 2 mav_df to ../output/data/top_2_model_mav_df.csv
2025-08-20 13:01:38,725 - INFO - Best clustering result: Model                                  SpectralCoclustering(random_state=42)
n_row                                                                      3
n_col                                                                      3
Explained Variance (%)                                             73.648391
Mean Silhouette                                                     0.387324
store                                                                      1
item                                                                  401911
store_cluster                                                              1
item_cluster                                                               0
store_item_mav                                                           0.0
store_cluster_item_cluster_mav_mean                                  0.07501
Within_Cluster_Var                                                  0.447015
Between_Cluster_Var                                                 0.275342
Ratio_Between_Within                                                0.615958
Name: 240, dtype: object
2025-08-20 13:01:38,726 - INFO - Optimal n_row: 3, n_col: 3
2025-08-20 13:01:38,726 - INFO - Optimal n_row: 3, n_col: 3

In [40]:
df2.head()

,date,store_item,store,item,weight,onpromotion,unit_sales,store_cluster,item_cluster,cluster
0,2014-01-01,1_1047679,1,1047679,1,False,0.0,0,0,0_0
1,2014-01-01,1_1168718,1,1168718,1,False,0.0,0,2,0_2
2,2014-01-01,1_1463591,1,1463591,1,False,0.0,0,0,0_0
3,2014-01-01,1_1463992,1,1463992,1,False,0.0,0,2,0_2
4,2014-01-01,1_1464092,1,1464092,1,False,0.0,0,2,0_2

In [41]:
df2["store_cluster"].nunique()

3

In [42]:
df2["item_cluster"].nunique()

4

In [7]:

def top_n_by_m(df, n_col="unit_sales", group_column="store_nbr", top_n=10):
    """
    Returns the top N stores by total unit sales.

    Parameters:
        df (pd.DataFrame): Input DataFrame.
        n_col (str): Column representing sales values.
        group_column (str): Column to group by (e.g., store number).
        top_n (int): Number of top results to return.

    Returns:
        pd.DataFrame: DataFrame of top N stores by total sales.
    """
    return (
        df.groupby(group_column)
        .agg({n_col: "sum"})
        .sort_values(n_col, ascending=False)
        .head(top_n)
    )

In [9]:
# Select top-M items globally
df_top_items = top_n_by_m(
    df, n_col="unit_sales", group_column="item", top_n=9000
)
valid_items = df_top_items.reset_index()["item"].tolist()
print(len(valid_items))
# Select top-N stores globally
df_top_stores = top_n_by_m(
    df, n_col="unit_sales", group_column="store", top_n=51
)
valid_stores = df_top_stores.reset_index()["store"].tolist()
print(len(valid_stores))
unique_dates = df["date"].dropna().unique()
grid = pd.MultiIndex.from_product(
    [valid_stores, valid_items, sorted(unique_dates)],
    names=["store", "item", "date"],
    ).to_frame(index=False)

4036
51

In [4]:
df.to_csv("../data/20250707_train.csv", index=False)

In [4]:
train_df["onpromotion"].unique()

array([nan, False, True], dtype=object)

In [5]:
def top_n_by_m(df, n_col="unit_sales", group_column="store_nbr", top_n=10):
    """
    Returns the top N stores by total unit sales.

    Parameters:
        df (pd.DataFrame): Input DataFrame.
        n_col (str): Column representing sales values.
        group_column (str): Column to group by (e.g., store number).
        top_n (int): Number of top results to return.

    Returns:
        pd.DataFrame: DataFrame of top N stores by total sales.
    """
    return df.groupby(group_column).agg({n_col: "sum"}).sort_values(n_col, ascending=False).head(top_n)

def top_values_with_percentage(df, group_column, value_column, n=5):
    """
    Returns the top N values with percentages for each group in a DataFrame.

    Args:
        df (pd.DataFrame): The input DataFrame.
        group_column (str): The column to group by.
        value_column (str): The column to calculate percentages from.
        n (int): The number of top values to return.

    Returns:
        pd.DataFrame: A DataFrame containing the top N values and their percentages for each group.
    """
    grouped = df.groupby(group_column)[value_column].value_counts(normalize=True) * 100
    grouped = grouped.rename('percentage').reset_index()
    top_n = grouped.groupby(group_column).apply(lambda x: x.nlargest(n, 'percentage')).reset_index(drop=True)
    return top_n


def value_counts_with_percentage(df, column_name, top_n = 10):
    """
    Computes value counts and percentage distribution of a column.

    Parameters:
        df (pd.DataFrame): Input DataFrame.
        column_name (str): Name of the column to analyze.

    Returns:
        pd.DataFrame: DataFrame with counts and percentages.
    """
    counts = df[column_name].value_counts()
    percentages = df[column_name].value_counts(normalize=True) * 100
    df = pd.DataFrame({column_name + '_count': counts, column_name + '_percentage': percentages})
    return df.sort_values(column_name, ascending=False).head(top_n)

In [6]:
df = top_n_by_m(train_df, n_col="unit_sales", group_column="store_nbr", top_n=100)

In [7]:
df

            unit_sales
store_nbr
44         62087544.00
45         54498012.00
47         50948308.00
3          50481900.00
49         43420088.00
46         41896052.00
48         35933132.00
51         32911484.00
8          30491336.00
50         28653018.00
11         28325556.00
7          26952020.00
9          26409398.00
6          25183676.00
24         23767730.00
2          21554618.00
39         20252192.00
37         19969834.00
27         19188020.00
4          18909698.00
38         18857920.00
40         18395758.00
28         18383154.00
17         18030968.00
31         17746828.00
34         17090728.00
43         16391689.00
5          15592405.00
36         15322424.00
41         14991006.00
33         14178461.00
1          14145012.00
18         13247102.00
19         13049505.00
20         12920954.00
23         11651380.00
15         11451269.00
25         11420996.00
14         11387919.00
53         11204904.00
54         11057482.00
16         10986413.00
12         10659218.00
13         10523000.00
29          9723158.00
10          9613906.00
21          9255499.00
42          8945768.00
26          7755104.00
35          7676677.50
30          7381893.50
32          5951784.00
22          4090201.75
52          2696169.75

In [8]:
# df.reset_index().to_excel(
#     "../output/data/20250627_top_100_store_sale.xlsx",
#     index=False
# )

In [9]:
# assuming df.reset_index()["store_nbr"] gives you the list of valid stores:
valid_stores = df.reset_index()["store_nbr"].tolist()

# Filter train_df to only rows whose store_nbr is in that list:
train_df_filtered = train_df[ train_df["store_nbr"].isin(valid_stores) ]

In [10]:
train_df_filtered = train_df_filtered.reset_index()
train_df_filtered.drop(["index"], axis=1, inplace=True)

In [11]:
train_df_filtered.head(4)

   id        date  store_nbr  item_nbr  unit_sales onpromotion
0   0  2013-01-01         25    103665         7.0         NaN
1   1  2013-01-01         25    105574         1.0         NaN
2   2  2013-01-01         25    105575         2.0         NaN
3   3  2013-01-01         25    108079         1.0         NaN

In [19]:
train_df_filtered["store_nbr"].nunique()

54

In [20]:
#top_values_with_percentage(train_df_filtered, "store_nbr", "unit_sales")

In [14]:
def count_percent(series, n=3):
    counts = series.value_counts().head(n)
    percentages = counts / series.count() * 100
    result = pd.DataFrame({'Count': counts, 'Percentage': percentages})
    return result

In [15]:
count_percent(train_df["item_nbr"], n=10)

          Count  Percentage
item_nbr
502331    83475    0.066516
314384    83450    0.066496
364606    83308    0.066382
265559    83047    0.066174
559870    82513    0.065749
1036689   82134    0.065447
273528    82108    0.065426
564533    82086    0.065409
261052    81774    0.065160
414353    81755    0.065145

In [16]:
len(train_df_filtered)

125497040

In [17]:
# assuming df.reset_index()["store_nbr"] gives you the list of valid stores:
valid_item = count_percent(train_df_filtered["item_nbr"], n=500).reset_index()["item_nbr"].tolist()

# Filter train_df to only rows whose store_nbr is in that list:
train_df_filtered = train_df_filtered[ train_df_filtered["item_nbr"].isin(valid_item) ]
train_df_filtered.head()

   id        date  store_nbr  item_nbr  unit_sales onpromotion
5   5  2013-01-01         25    108786         3.0         NaN
6   6  2013-01-01         25    108797         1.0         NaN
7   7  2013-01-01         25    108952         1.0         NaN
8   8  2013-01-01         25    111397        13.0         NaN
9   9  2013-01-01         25    114790         3.0         NaN

In [29]:
len(train_df_filtered)

34824868

In [19]:
print(train_df_filtered["store_nbr"].nunique())
print(train_df_filtered["item_nbr"].nunique())

54
500

In [20]:
 # Save to a new CSV
 
train_df_filtered.to_csv(
    "../output/data/20250630_train_top_store_500_item.csv",
    index=False
)

In [7]:
train_df["date"] = pd.to_datetime(train_df["date"])
min_date = train_df['date'].min()
cutoff_date = min_date + pd.Timedelta(days=90)

# 3. Filter to the first 30 days
first_n_days = train_df[
    (train_df['date'] >= min_date) &
    (train_df['date'] <= cutoff_date)
].copy()

# 4. (Optional) Sort if you want chronological order
first_n_days.sort_values(['date', 'store_nbr', 'item_nbr'], inplace=True)

In [8]:
first_n_days.head(5)

   id       date  store_nbr  item_nbr  unit_sales onpromotion
0   0 2013-01-01         25    103665         7.0         NaN
1   1 2013-01-01         25    105574         1.0         NaN
2   2 2013-01-01         25    105575         2.0         NaN
3   3 2013-01-01         25    108079         1.0         NaN
4   4 2013-01-01         25    108701         1.0         NaN

In [9]:
first_n_days.reset_index(drop=True, inplace=True)

In [10]:
first_n_days["date"].unique()

<DatetimeArray>
['2013-01-01 00:00:00', '2013-01-02 00:00:00', '2013-01-03 00:00:00',
 '2013-01-04 00:00:00', '2013-01-05 00:00:00', '2013-01-06 00:00:00',
 '2013-01-07 00:00:00', '2013-01-08 00:00:00', '2013-01-09 00:00:00',
 '2013-01-10 00:00:00', '2013-01-11 00:00:00', '2013-01-12 00:00:00',
 '2013-01-13 00:00:00', '2013-01-14 00:00:00', '2013-01-15 00:00:00',
 '2013-01-16 00:00:00', '2013-01-17 00:00:00', '2013-01-18 00:00:00',
 '2013-01-19 00:00:00', '2013-01-20 00:00:00', '2013-01-21 00:00:00',
 '2013-01-22 00:00:00', '2013-01-23 00:00:00', '2013-01-24 00:00:00',
 '2013-01-25 00:00:00', '2013-01-26 00:00:00', '2013-01-27 00:00:00',
 '2013-01-28 00:00:00', '2013-01-29 00:00:00', '2013-01-30 00:00:00',
 '2013-01-31 00:00:00', '2013-02-01 00:00:00', '2013-02-02 00:00:00',
 '2013-02-03 00:00:00', '2013-02-04 00:00:00', '2013-02-05 00:00:00',
 '2013-02-06 00:00:00', '2013-02-07 00:00:00', '2013-02-08 00:00:00',
 '2013-02-09 00:00:00', '2013-02-10 00:00:00', '2013-02-11 00:00:00',
 '2013-02-12 00:00:00', '2013-02-13 00:00:00', '2013-02-14 00:00:00',
 '2013-02-15 00:00:00', '2013-02-16 00:00:00', '2013-02-17 00:00:00',
 '2013-02-18 00:00:00', '2013-02-19 00:00:00', '2013-02-20 00:00:00',
 '2013-02-21 00:00:00', '2013-02-22 00:00:00', '2013-02-23 00:00:00',
 '2013-02-24 00:00:00', '2013-02-25 00:00:00', '2013-02-26 00:00:00',
 '2013-02-27 00:00:00', '2013-02-28 00:00:00', '2013-03-01 00:00:00',
 '2013-03-02 00:00:00', '2013-03-03 00:00:00', '2013-03-04 00:00:00',
 '2013-03-05 00:00:00', '2013-03-06 00:00:00', '2013-03-07 00:00:00',
 '2013-03-08 00:00:00', '2013-03-09 00:00:00', '2013-03-10 00:00:00',
 '2013-03-11 00:00:00', '2013-03-12 00:00:00', '2013-03-13 00:00:00',
 '2013-03-14 00:00:00', '2013-03-15 00:00:00', '2013-03-16 00:00:00',
 '2013-03-17 00:00:00', '2013-03-18 00:00:00', '2013-03-19 00:00:00',
 '2013-03-20 00:00:00', '2013-03-21 00:00:00', '2013-03-22 00:00:00',
 '2013-03-23 00:00:00', '2013-03-24 00:00:00', '2013-03-25 00:00:00',
 '2013-03-26 00:00:00', '2013-03-27 00:00:00', '2013-03-28 00:00:00',
 '2013-03-29 00:00:00', '2013-03-30 00:00:00', '2013-03-31 00:00:00',
 '2013-04-01 00:00:00']
Length: 91, dtype: datetime64[ns]

In [11]:
 # Save to a new CSV
first_n_days.to_csv(
    "./data/train_first_90_days.csv",
    index=False
)

print(f"Kept records from {min_date.date()} to {cutoff_date.date()} – {len(first_n_days)} rows saved.")

Kept records from 2013-01-01 to 2013-04-01 – 3738322 rows saved.

In [12]:
train_df.groupby(["store_nbr","item_nbr"]).agg({"id":"count"})

                      id
store_nbr item_nbr
1         96995      187
          99197      185
          103520    1119
          103665    1358
          105574    1546
...                  ...
54        2110456     47
          2113343      8
          2113914     36
          2116416     11
          2124052      1

[174685 rows x 1 columns]

In [13]:
train_df["item_nbr"].nunique()

4036

In [14]:
train_df["store_nbr"].nunique()

54

In [15]:
train_df.shape

(125497040, 6)

In [16]:
train_df.groupby("store_nbr").agg({"unit_sales":"sum"}).sort_values("unit_sales",ascending=False).head(10)

           unit_sales
store_nbr
44         62087544.0
45         54498012.0
47         50948308.0
3          50481900.0
49         43420088.0
46         41896052.0
48         35933132.0
51         32911484.0
8          30491336.0
50         28653018.0

In [9]:
top_n_by_m(train_df)

             unit_sales
store_nbr
3          24060.347656
8          14659.328125
6          13520.485352
7          11997.501953
5          10598.619141
2          10266.718750
4          10200.083984
9           9757.633789
1           7417.147949
25          2511.618896

In [11]:
value_counts_with_percentage(train_df, "item_nbr")

          item_nbr_count  item_nbr_percentage
item_nbr
165718                10                 0.10
103665                10                 0.10
165705                10                 0.10
165704                10                 0.10
115267                10                 0.10
...                  ...                  ...
268446                 1                 0.01
279125                 1                 0.01
302824                 1                 0.01
554145                 1                 0.01
557289                 1                 0.01

[1469 rows x 2 columns]

In [13]:
df = train_df.groupby("date")["unit_sales"].sum().reset_index()  # Aggregate daily sales

In [14]:
df.shift(5)

   date  unit_sales
0  None         NaN
1  None         NaN